hopegeng/nc_bq79600_ads/app/tle9012/inc/tle9012_reg.h
/*
 * tle9012_reg.h
 *
 *  Created on: Jul 21, 2020
 *      Author: robertkearney
 *
 *  2025: Changed from AQU to DQU
 */

#include <stdint.h>

#ifndef TLE9012_TLE9012_REG_H_
#define TLE9012_TLE9012_REG_H_

// @enum TLE9012_PART_CONFIG_Configuration_Position_t | Defines Cell Enable
typedef enum TLE9012_PART_CONFIG_Configuration_Position_tag
{
	TLE9012_CONFIGURATION_POSITION_EN_CELL_0  =  0, // @emem [ 0] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_EN_CELL_1  =  1, // @emem [ 1] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_EN_CELL_2  =  2, // @emem [ 2] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_EN_CELL_3  =  3, // @emem [ 3] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_EN_CELL_4  =  4, // @emem [ 4] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_EN_CELL_5  =  5, // @emem [ 5] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_EN_CELL_6  =  6, // @emem [ 6] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_EN_CELL_7  =  7, // @emem [ 7] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_EN_CELL_8  =  8, // @emem [ 8] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_EN_CELL_9  =  9, // @emem [ 9] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_EN_CELL_10 = 10, // @emem [10] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_EN_CELL_11 = 11, // @emem [11] STATIC INITIALIZATION ONLY Cell # from initial define
}TLE9012_PART_CONFIG_Configuration_Position_t;

// @enum TLE9012_PART_CONFIG_Configuration_Position_t | Defines Cell Enable
typedef enum TLE9012_PART_CONFIG_Configuration_Width_tag
{
	TLE9012_CONFIGURATION_WIDTH_EN_CELL_0  =  1, // @emem [ 0] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_EN_CELL_1  =  1, // @emem [ 1] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_EN_CELL_2  =  1, // @emem [ 2] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_EN_CELL_3  =  1, // @emem [ 3] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_EN_CELL_4  =  1, // @emem [ 4] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_EN_CELL_5  =  1, // @emem [ 5] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_EN_CELL_6  =  1, // @emem [ 6] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_EN_CELL_7  =  1, // @emem [ 7] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_EN_CELL_8  =  1, // @emem [ 8] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_EN_CELL_9  =  1, // @emem [ 9] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_EN_CELL_10 =  1, // @emem [10] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_EN_CELL_11 =  1, // @emem [11] STATIC INITIALIZATION ONLY Cell # from initial define
}TLE9012_PART_CONFIG_Configuration_Width_t;

typedef union TLE9012_PART_CONFIG_Register_u
{
	struct TLE9012_PART_CONFIG_Register_s
	{
		uint16_t  EN_CELL0:  1; /* Enable cell monitoring for cell 0 */
		uint16_t  EN_CELL1:  1; /* Enable cell monitoring for cell 1 */
		uint16_t  EN_CELL2:  1; /* Enable cell monitoring for cell 2 */
		uint16_t  EN_CELL3:  1; /* Enable cell monitoring for cell 3 */
		uint16_t  EN_CELL4:  1; /* Enable cell monitoring for cell 4 */
		uint16_t  EN_CELL5:  1; /* Enable cell monitoring for cell 5 */
		uint16_t  EN_CELL6:  1; /* Enable cell monitoring for cell 6 */
		uint16_t  EN_CELL7:  1; /* Enable cell monitoring for cell 7 */
		uint16_t  EN_CELL8:  1; /* Enable cell monitoring for cell 8 */
		uint16_t  EN_CELL9:  1; /* Enable cell monitoring for cell 9 */
		uint16_t  EN_CELL10: 1; /* Enable cell monitoring for cell 10 */
		uint16_t  EN_CELL11: 1; /* Enable cell monitoring for cell 11 */
		uint16_t  RES:       3; /* Reserved for future use */
	} B;
	uint16_t U16;

} TLE9012_PART_CONFIG_Register_t;


/* Cell voltage thresholds (supplied in sleep) */

// @enum TLE9012_PART_CONFIG_Configuration_Position_t | Defines Cell Enable
typedef enum TLE9012_OL_OV_THR_Configuration_Position_tag
{
	TLE9012_CONFIGURATION_POSITION_OV_THR  		=  0, // @emem [ 0] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_OL_THR_MAX  	= 10  // @emem [ 1] STATIC INITIALIZATION ONLY Cell # from initial define
}TLE9012_OL_OV_THR_Configuration_Position_t;

// @enum TLE9012_PART_CONFIG_Configuration_Position_t | Defines Cell Enable
typedef enum TLE9012_OL_OV_THR_Configuration_Width_tag
{
	TLE9012_CONFIGURATION_WIDTH_OV_THR  	= 10, // @emem [ 0] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_OL_THR_MAX 	=  6  // @emem [ 1] STATIC INITIALIZATION ONLY Cell # from initial define
}TLE9012_OL_OV_THR_Configuration_Width_t;


typedef union TLE9012_OL_OV_THR_Register_u
{
	struct TLE9012_OL_OV_THR_Register_s
	{
		uint16_t  OV_THR:     10; /* Overvoltage fault threshold (LSB10) */
		uint16_t  OL_THR_MAX:  6; /* Openload maximum voltage drop threshold (LSB6) */
	} B;
	uint16_t U16;

} TLE9012_OL_OV_THR_Register_t;

// @enum TLE9012_PART_CONFIG_Configuration_Position_t | Defines Cell Enable
typedef enum TLE9012_OL_UV_THR_Configuration_Position_tag
{
	TLE9012_CONFIGURATION_POSITION_UV_THR  		=  0, // @emem [ 0] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_OL_THR_MIN  	= 10  // @emem [11] STATIC INITIALIZATION ONLY Cell # from initial define
}TLE9012_OL_UV_THR_Configuration_Position_t;

// @enum TLE9012_PART_CONFIG_Configuration_Position_t | Defines Cell Enable
typedef enum TLE9012_OL_UV_THR_Configuration_Width_tag
{
	TLE9012_CONFIGURATION_WIDTH_UV_THR  	= 10, // @emem [ 0] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_OL_THR_MIN  =  6  // @emem [ 1] STATIC INITIALIZATION ONLY Cell # from initial define
}TLE9012_OL_UV_THR_Configuration_Width_t;


/* Cell voltage thresholds (supplied in sleep) */
typedef union TLE9012_OL_UV_THR_Register_u
{
	struct TLE9012_OL_UV_THR_Register_s
	{
		uint16_t  UV_THR:     10; /* Undervoltage fault threshold (LSB10) */
		uint16_t  OL_THR_MIN:  6; /* Openload minimum voltage drop threshold (LSB6) */
	} B;
	uint16_t U16;

