hopegeng/nc_bq79600_ads/app/tle9012/inc/tle9012_reg.h
} TLE9012_OL_UV_THR_Register_t;

// @enum TLE9012_PART_CONFIG_Configuration_Position_t | Defines Cell Enable
typedef enum TLE9012_TEMP_CONF_Configuration_Position_tag
{
	TLE9012_CONFIGURATION_POSITION_EXT_OT_THR  		=  0, // @emem [ 0] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_I_NTC  			= 10, // @emem [ 1] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_NR_TEMP_SENSE  	= 12  // @emem [ 2] STATIC INITIALIZATION ONLY Cell # from initial define
}TLE9012_TEMP_CONF_Configuration_Position_t;

// @enum TLE9012_PART_CONFIG_Configuration_Position_t | Defines Cell Enable
typedef enum TLE9012_TEMP_CONF_Configuration_Width_tag
{
	TLE9012_CONFIGURATION_WIDTH_EXT_OT_THR  	= 10, // @emem [ 0] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_I_NTC  			=  2, // @emem [ 1] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_NR_TEMP_SENSE  	=  3  // @emem [11] STATIC INITIALIZATION ONLY Cell # from initial define
}TLE9012_TEMP_CONF_Configuration_Width_t;


/* Temperature measurement configuration (supplied in sleep) */
typedef union TLE9012_TEMP_CONF_Register_u
{
	struct TLE9012_TEMP_CONF_Register_s
	{
		uint16_t  EXT_OT_THR:    10; /* External temperature overtemperature threshold */
		uint16_t  I_NTC:          2; /* Current source used for OT fault */
		uint16_t  NR_TEMP_SENSE:  3; /* Number of external temperature sensors */
		uint16_t  RES:            1; /* Reserved for future use */
	} B;
	uint16_t U16;

} TLE9012_TEMP_CONF_Register_t;

// @enum TLE9012_INT_OT_THR_Configuration_Width_t | Defines Internal temperature overtemperature threshold position
typedef enum TLE9012_INT_OT_THR_Configuration_Position_tag
{
	TLE9012_CONFIGURATION_POSITION_INT_OT_THR  =  0  // @emem [ 0] STATIC INITIALIZATION ONLY Cell # from initial define
}TLE9012_INT_OT_THR_Configuration_Position_t;

// @enum TLE9012_INT_OT_THR_Configuration_Width_t | Defines Internal temperature overtemperature threshold width
typedef enum TLE9012_INT_OT_THR_Configuration_Width_tag
{
	TLE9012_CONFIGURATION_WIDTH_INT_OT_THR  =  10  // @emem [ 0] STATIC INITIALIZATION ONLY Cell # from initial define
}TLE9012_INT_OT_THR_Configuration_Width_t;


/* Internal temperature measurement configuration (supplied in sleep)*/
typedef union TLE9012_INT_OT_WARN_CONF_Register_u
{
	struct TLE9012_INT_OT_WARN_CONF_Register_s
	{
		uint16_t  INT_OT_THR: 10; /* Internal temperature overtemperature threshold */
		uint16_t  RES:         6; /* Reserved for future use */
	} B;
	uint16_t U16;

} TLE9012_INT_OT_WARN_CONF_Register_t;
/* Round Robin ERR counters (supplied in sleep) */
typedef union TLE9012_RR_ERR_CNT_Register_u
{
	struct TLE9012_RR_ERR_CNT_Register_s
	{
		uint16_t  NR_ERR:             3; /* Number of errors */
		uint16_t  NR_EXT_TEMP_START:  3; /* External temperature triggering in round robin */
		uint16_t  RR_SLEEP_CNT:      10; /* Round Robin timing in sleep mode */
	} B;
	uint16_t U16;

} TLE9012_RR_ERR_CNT_Register_t;

// @enum TLE9012_PART_CONFIG_Configuration_Position_t | Defines Cell Enable
typedef enum TLE9012_RR_CONFIG_Configuration_Position_tag
{
	TLE9012_CONFIGURATION_POSITION_RR_CNT            =  0, // @emem [ 0] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_RR_SYNC           =  7, // @emem [ 1] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_M_NR_ERR_ADC_ERR  =  8, // @emem [ 2] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_M_NR_ERR_OL_ERR   =  9, // @emem [ 3] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_M_NR_ERR_EXT_OT   = 10, // @emem [ 4] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_M_NR_ERR_INT_OT   = 11, // @emem [ 5] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_M_NR_ERR_CELL_UV  = 12, // @emem [ 6] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_M_NR_ERR_CELL_OV  = 13, // @emem [ 7] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_M_NR_ERR_BAL_UC   = 14, // @emem [ 8] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_M_NR_ERR_BAL_OC   = 15  // @emem [ 9] STATIC INITIALIZATION ONLY Cell # from initial define
}TLE9012_RR_CONFIG_Configuration_Position_t;

// @enum TLE9012_PART_CONFIG_Configuration_Position_t | Defines Cell Enable
typedef enum TLE9012_RR_CONFIG_Configuration_Width_tag
{
	TLE9012_CONFIGURATION_WIDTH_RR_CNT            =  7, // @emem [ 0] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_RR_SYNC           =  1, // @emem [ 1] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_M_NR_ERR_ADC_ERR  =  1, // @emem [ 2] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_M_NR_ERR_OL_ERR   =  1, // @emem [ 3] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_M_NR_ERR_EXT_OT   =  1, // @emem [ 4] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_M_NR_ERR_INT_OT   =  1, // @emem [ 5] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_M_NR_ERR_CELL_UV  =  1, // @emem [ 6] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_M_NR_ERR_CELL_OV  =  1, // @emem [ 7] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_M_NR_ERR_BAL_UC   =  1, // @emem [ 8] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_M_NR_ERR_BAL_OC   =  1  // @emem [ 9] STATIC INITIALIZATION ONLY Cell # from initial define
}TLE9012_RR_CONFIG_Configuration_Width_t;


/* Round Robin configuration (supplied in sleep) */
typedef union TLE9012_RR_CONFIG_Register_u
{
	struct TLE9012_RR_CONFIG_Register_s
	{
		uint16_t  RR_CNT:           7; /* Round Robin counter */
		uint16_t  RR_SYNC:          1; /* Round Robin synchronization */
		uint16_t  M_NR_ERR_ADC_ERR: 1; /* mask NR_ERR counter for ADC error */
		uint16_t  M_NR_ERR_OL_ERR:  1; /* mask NR_ERR counter for open load error */
		uint16_t  M_NR_ERR_EXT_OT:  1; /* mask NR_ERR counter for external temperature error */
		uint16_t  M_NR_ERR_INT_OT:  1; /* mask NR_ERR counter for internal temperature error */
		uint16_t  M_NR_ERR_CELL_UV: 1; /* mask NR_ERR counter for undervoltage error */
		uint16_t  M_NR_ERR_CELL_OV: 1; /* mask NR_ERR counter for overvoltage error */
		uint16_t  M_NR_ERR_BAL_UC:  1; /* mask NR_ERR counter for balancing error undercurrent */
		uint16_t  M_NR_ERR_BAL_OC:  1; /* mask NR_ERR counter for balancing error overcurrent */
	} B;
	uint16_t U16;

} TLE9012_RR_CONFIG_Register_t;
/* ERR pin / EMM mask (supplied in sleep) */
typedef union TLE9012_FAULT_MASK_Register_u
{
	struct TLE9012_FAULT_MASK_Register_s
	{
		uint16_t  RES:           5; /* Reserved for future use */
		uint16_t  ERR_PIN:       1; /* Enable Error PIN functionality */
		uint16_t  M_ADC_ERR:     1; /* EMM/ERR mask for ADC error */
		uint16_t  M_OL_ERR:      1; /* EMM/ERR mask for openload error */
		uint16_t  M_INT_IC_ERR:  1; /* EMM/ERR mask for internal IC error */
		uint16_t  M_REG_CRC_ERR: 1; /* EMM/ERR mask for register CRC error */
		uint16_t  M_EXT_OT:      1; /* EMM/ERR mask for external temperature error */
		uint16_t  M_INT_OT:      1; /* EMM/ERR mask for internal temperature error */
		uint16_t  M_CELL_UV:     1; /* EMM/ERR mask for cell undervoltage error */
		uint16_t  M_CELL_OV:     1; /* EMM/ERR mask for cell overvoltage error */
		uint16_t  M_BAL_ERR_UC:  1; /* EMM/ERR mask for balancing error undercurrent */
		uint16_t  M_BAL_ERR_OC:  1; /* EMM/ERR mask for balancing error overcurrent */
	} B;
	uint16_t U16;

