hopegeng/nc_bq79600_ads/app/tle9012/inc/tle9012_reg.h
} TLE9012_FAULT_MASK_Register_t;
/* General diagnosis (supplied in sleep) */
typedef union TLE9012_GEN_DIAG_Register_u
{
	struct TLE9012_GEN_DIAG_Register_s
	{
		uint16_t  GPIO_WAKEUP:  1; /* Wake-up via GPIO */
		uint16_t  MOT_MOB_N:    1; /* Master on Top/Bottom configuration */
		uint16_t  BAL_ACTIVE:   1; /* Balancing active */
		uint16_t  LOCK_MEAS:    1; /* Lock measurement */
		uint16_t  RR_ACTIVE:    1; /* Round Robin active */
		uint16_t  UV_SLEEP:     1; /* Undervoltage induced sleep */
		uint16_t  ADC_ERR:      1; /* ADC Error */
		uint16_t  OL_ERR:       1; /* Openload error */
		uint16_t  INT_IC_ERR:   1; /* Internal IC error */
		uint16_t  REG_CRC_ERR:  1; /* Register CRC error */
		uint16_t  EXT_OT:       1; /* External temperature (OT) error */
		uint16_t  INT_OT:       1; /* Internal temperature (OT) error */
		uint16_t  CELL_UV:      1; /* Cell undervoltage (UV) error */
		uint16_t  CELL_OV:      1; /* Cell overvoltage (OV) error */
		uint16_t  BAL_ERR_UC:   1; /* Balancing error undercurrent (not supplied in sleep mode) */
		uint16_t  BAL_ERR_OC:   1; /* Balancing error overcurrent (not supplied in sleep mode) */
	} B;
	uint16_t U16;

} TLE9012_GEN_DIAG_Register_t;
/* Cell voltage supervision warning flags UV (supplied in sleep)*/
typedef union TLE9012_CELL_UV_Register_u
{
	struct TLE9012_CELL_UV_Register_s
	{
		uint16_t  UV_0:  1; /* Undervoltage in cell 0 */
		uint16_t  UV_1:  1; /* Undervoltage in cell 1 */
		uint16_t  UV_2:  1; /* Undervoltage in cell 2 */
		uint16_t  UV_3:  1; /* Undervoltage in cell 3 */
		uint16_t  UV_4:  1; /* Undervoltage in cell 4 */
		uint16_t  UV_5:  1; /* Undervoltage in cell 5 */
		uint16_t  UV_6:  1; /* Undervoltage in cell 6 */
		uint16_t  UV_7:  1; /* Undervoltage in cell 7 */
		uint16_t  UV_8:  1; /* Undervoltage in cell 8 */
		uint16_t  UV_9:  1; /* Undervoltage in cell 9 */
		uint16_t  UV_10: 1; /* Undervoltage in cell 10 */
		uint16_t  UV_11: 1; /* Undervoltage in cell 11 */
		uint16_t  RES:   4; /* Reserved for future use */
	} B;
	uint16_t U16;

} TLE9012_CELL_UV_Register_t;
/* Cell voltage supervision warning flags OV(supplied in sleep) */
typedef union TLE9012_CELL_OV_Register_u
{
	struct TLE9012_CELL_OV_Register_s
	{
		uint16_t  OV_0:  1; /* Overvoltage in cell 0 */
		uint16_t  OV_1:  1; /* Overvoltage in cell 1 */
		uint16_t  OV_2:  1; /* Overvoltage in cell 2 */
		uint16_t  OV_3:  1; /* Overvoltage in cell 3 */
		uint16_t  OV_4:  1; /* Overvoltage in cell 4 */
		uint16_t  OV_5:  1; /* Overvoltage in cell 5 */
		uint16_t  OV_6:  1; /* Overvoltage in cell 6 */
		uint16_t  OV_7:  1; /* Overvoltage in cell 7 */
		uint16_t  OV_8:  1; /* Overvoltage in cell 8 */
		uint16_t  OV_9:  1; /* Overvoltage in cell 9 */
		uint16_t  OV_10: 1; /* Overvoltage in cell 10 */
		uint16_t  OV_11: 1; /* Overvoltage in cell 11 */
		uint16_t  RES:   4; /* Reserved for future use */
	} B;
	uint16_t U16;

} TLE9012_CELL_OV_Register_t;
/* External overtemperature warning flags (supplied in sleep) */
typedef union TLE9012_EXT_TEMP_DIAG_Register_u
{
	struct TLE9012_EXT_TEMP_DIAG_Register_s
	{
		uint16_t  OPEN_0:   1; /* Openload in ext. temp 0 */
		uint16_t  SHORT_0:  1; /* Short in ext. temp 0 */
		uint16_t  OT_0:     1; /* Overtemperature in ext. temp 0 */
		uint16_t  OPEN_1:   1; /* Openload in ext. temp 1 */
		uint16_t  SHORT_1:  1; /* Short in ext. temp 1 */
		uint16_t  OT_1:     1; /* Overtemperature in ext. temp 1 */
		uint16_t  OPEN_2:   1; /* Openload in ext. temp 2 */
		uint16_t  SHORT_2:  1; /* Short in ext. temp 2 */
		uint16_t  OT_2:     1; /* Overtemperature in ext. temp 2 */
		uint16_t  OPEN_3:   1; /* Openload in ext. temp 3 */
		uint16_t  SHORT_3:  1; /* Short in ext. temp 3 */
		uint16_t  OT_3:     1; /* Overtemperature in ext. temp 3 */
		uint16_t  OPEN_4:   1; /* Openload in ext. temp 4 */
		uint16_t  SHORT_4:  1; /* Short in ext. temp 4 */
		uint16_t  OT_4:     1; /* Overtemperature in ext. temp 4 */
		uint16_t  RES:      1; /* Reserved for future use */
	} B;
	uint16_t U16;

} TLE9012_EXT_TEMP_DIAG_Register_t;
/* Diagnosis OPENLOAD (supplied in sleep) */
typedef union TLE9012_DIAG_OL_Register_u
{
	struct TLE9012_DIAG_OL_Register_s
	{
		uint16_t  OL_0:  1; /* Openload in cell 0 */
		uint16_t  OL_1:  1; /* Openload in cell 1 */
		uint16_t  OL_2:  1; /* Openload in cell 2 */
		uint16_t  OL_3:  1; /* Openload in cell 3 */
		uint16_t  OL_4:  1; /* Openload in cell 4 */
		uint16_t  OL_5:  1; /* Openload in cell 5 */
		uint16_t  OL_6:  1; /* Openload in cell 6 */
		uint16_t  OL_7:  1; /* Openload in cell 7 */
		uint16_t  OL_8:  1; /* Openload in cell 8 */
		uint16_t  OL_9:  1; /* Openload in cell 9 */
		uint16_t  OL_10: 1; /* Openload in cell 10 */
		uint16_t  OL_11: 1; /* Openload in cell 11 */
		uint16_t  RES:   4; /* Reserved for future use */
	} B;
	uint16_t U16;

} TLE9012_DIAG_OL_Register_t;
/* REG_CRC_ERR (supplied in sleep) */
typedef union TLE9012_REG_CRC_ERR_Register_u
{
	struct TLE9012_REG_CRC_ERR_Register_s
	{
		uint16_t  ADDR:  7; /* Register Address of register where CRC check failed */
		uint16_t  RES:   9; /* Reserved for future use */
	} B;
	uint16_t U16;

} TLE9012_REG_CRC_ERR_Register_t;
/* Operation mode */
typedef union TLE9012_OP_MODE_Register_u
{
	struct TLE9012_OP_MODE_Register_s
	{
		uint16_t  PD:       1; /* Activate sleep mode */
		uint16_t  EXT_WD:   1; /* Extended watchdog */
		uint16_t  RES:     14; /* Reserved for future use */
	} B;
	uint16_t U16;

} TLE9012_OP_MODE_Register_t;

// @enum TLE9012_PART_CONFIG_Configuration_Position_t | Defines Cell Enable
typedef enum TLE9012_BAL_CURR_THR_Configuration_Position_tag
{
	TLE9012_CONFIGURATION_POSITION_OC_THR  =  0, // @emem [ 0] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_UC_THR  =  8  // @emem [ 1] STATIC INITIALIZATION ONLY Cell # from initial define
}TLE9012_BAL_CURR_THR_Configuration_Position_t;

// @enum TLE9012_PART_CONFIG_Configuration_Position_t | Defines Cell Enable
typedef enum TLE9012_BAL_CURR_THR_Configuration_Width_tag
{
	TLE9012_CONFIGURATION_WIDTH_OC_THR    =  8, // @emem [ 0] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_UC_THR    =  8  // @emem [ 1] STATIC INITIALIZATION ONLY Cell # from initial define
}TLE9012_BAL_CURR_THR_Configuration_Width_t;


/* Balancing current thresholds */
typedef union TLE9012_BAL_CURR_THR_Register_u
{
	struct TLE9012_BAL_CURR_THR_Register_s
	{
		uint16_t  OC_THR:  8; /* Overcurrent fault threshold */
		uint16_t  UC_THR:  8; /* Undercurrent fault threshold */
	} B;
	uint16_t U16;

} TLE9012_BAL_CURR_THR_Register_t;

