hopegeng/nc_bq79600_ads/app/tle9012/inc/tle9012_reg.h
/* Balance settings */
typedef union TLE9012_BAL_SETTINGS_Register_u
{
	struct TLE9012_BAL_SETTINGS_Register_s
	{
		uint16_t  OL_0:  1; /* Openload in cell 0 */
		uint16_t  OL_1:  1; /* Openload in cell 1 */
		uint16_t  OL_2:  1; /* Openload in cell 2 */
		uint16_t  OL_3:  1; /* Openload in cell 3 */
		uint16_t  OL_4:  1; /* Openload in cell 4 */
		uint16_t  OL_5:  1; /* Openload in cell 5 */
		uint16_t  OL_6:  1; /* Openload in cell 6 */
		uint16_t  OL_7:  1; /* Openload in cell 7 */
		uint16_t  OL_8:  1; /* Openload in cell 8 */
		uint16_t  OL_9:  1; /* Openload in cell 9 */
		uint16_t  OL_10: 1; /* Openload in cell 10 */
		uint16_t  OL_11: 1; /* Openload in cell 11 */
		uint16_t  RES:   4; /* Reserved for future use */
	} B;
	uint16_t U16;

} TLE9012_BAL_SETTINGS_Register_t;
// @enum TLE9012_PART_CONFIG_Configuration_Position_t | Defines Cell Enable
typedef enum TLE9012_AVM_CONFIG_Configuration_Position_tag
{
	TLE9012_CONFIGURATION_POSITION_TEMP_MUX_DIAG_SEL  =  0, // @emem [ 0] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_AVM_TMP0_MASK      =  3, // @emem [ 1] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_AVM_TMP1_MASK      =  4, // @emem [ 2] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_AVM_AUX0_MASK      =  6, // @emem [ 3] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_AVM_AUX1_MASK      =  7, // @emem [ 4] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_POSITION_R_DIAG             =  8  // @emem [ 5] STATIC INITIALIZATION ONLY Cell # from initial define
}TLE9012_AVM_CONFIG_Configuration_Position_t;

// @enum TLE9012_PART_CONFIG_Configuration_Position_t | Defines Cell Enable
typedef enum TLE9012_AVM_CONFIG_Configuration_Width_tag
{
	TLE9012_CONFIGURATION_WIDTH_TEMP_MUX_DIAG_SEL  	=  3, // @emem [ 0] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_AVM_TMP0_MASK  		=  1, // @emem [ 1] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_AVM_TMP1_MASK  		=  1, // @emem [ 2] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_AVM_AUX0_MASK  		=  1, // @emem [ 3] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_AVM_AUX1_MASK  		=  1, // @emem [ 4] STATIC INITIALIZATION ONLY Cell # from initial define
	TLE9012_CONFIGURATION_WIDTH_R_DIAG         		=  1  // @emem [ 5] STATIC INITIALIZATION ONLY Cell # from initial define
}TLE9012_AVM_CONFIG_Configuration_Width_t;


/* Auxiliary Voltage Measurement Configuration */
typedef union TLE9012_AVM_CONFIG_Register_u
{
	struct TLE9012_AVM_CONFIG_Register_s
	{
		uint16_t  TEMP_MUX_DIAG_SEL:  3; /* Selector for ext. temp diagnose */
		uint16_t  AVM_TMP0_MASK:      1; /* Masking ext. temp 0 measurement as part of AVM */
		uint16_t  AVM_TMP1_MASK:      1; /* Masking ext. temp 1 measurement as part of AVM */
		uint16_t  RES_0:              1; /* Reserved for future use */
		uint16_t  AVM_AUX0_MASK:      1; /* Masking auxiliary measurement 0 as part of AVM */
		uint16_t  AVM_AUX1_MASK:      1; /* Masking auxiliary measurement 1 as part of AVM */
		uint16_t  RES_1:              1; /* Reserved for future use */
		uint16_t  R_DIAG:             1; /* Masking diagnosis resistor as part of AVM */
		uint16_t  RES_2:              6; /* Reserved for future use */
	} B;
	uint16_t U16;

} TLE9012_AVM_CONFIG_Register_t;

/* Measurement control */
/* TLE9012DQU */
typedef union TLE9012_MEAS_CTRL_Register_u
{
	struct TLE9012_MEAS_CTRL_Register_s
	{
		uint16_t  CVM_DEL:        5; /* CVM delay timer */
		uint16_t  PBOFF:          1; /* Enable PBOFF time */
		uint16_t  SAR_START:      1; /* Reserved for future use */
		uint16_t  AVM_START:      1; /* Start auxiliary voltage measurement */
		uint16_t  BVM_BIT_WIDTH:  3; /* Bit width of block voltage measurement */
		uint16_t  BVM_START:      1; /* Start block voltage measurement */
		uint16_t  CVM_BIT_WIDTH:  3; /* Bit width of cell voltage measurement */
		uint16_t  CVM_START:      1; /* Start cell voltage measurement */
	} B;
	uint16_t U16;
} TLE9012_MEAS_CTRL_Register_t;

/* Cell voltage measurement 0 */
typedef union TLE9012_CVM_Register_u
{
	struct TLE9012_CVM_Register_s
	{
		uint16_t  RESULT: 16; /* Result of cell voltage measurement */
	} B;
	uint16_t U16;

} TLE9012_CVM_Register_t;
/* Block voltage measurement */
typedef union TLE9012_BVM_Register_u
{
	struct TLE9012_BVM_Register_s
	{
		uint16_t  RESULT: 16; /* Result of block voltage measurement */
	} B;
	uint16_t U16;

} TLE9012_BVM_Register_t;
/* Temp result 0 */
typedef union TLE9012_EXT_TEMP_Register_u
{
	struct TLE9012_EXT_TEMP_Register_s
	{
		uint16_t  RESULT:   10; /* Result of block voltage measurement */
		uint16_t  INTC:      2; /* Indicates which current source was used */
		uint16_t  PULLDOWN:  1; /* Indicating pulldown switch state */
		uint16_t  VALID:     1; /* Indicating a valid result */
		uint16_t  RES:       2; /* Reserved for future use */
	} B;
	uint16_t U16;

} TLE9012_EXT_TEMP_Register_t;
/* Temp result R Diagnose */
typedef union TLE9012_EXT_TEMP_R_DIAG_Register_u
{
	struct TLE9012_EXT_TEMP_R_DIAG_Register_s
	{
		uint16_t  RESULT:   10; /* Result of block voltage measurement */
		uint16_t  INTC:      2; /* Indicates which current source was used */
		uint16_t  RES_0:     1; /* Reserved for future use */
		uint16_t  VALID:     1; /* Indicating a valid result */
		uint16_t  RES_1:     2; /* Reserved for future use */
	} B;
	uint16_t U16;

} TLE9012_EXT_TEMP_R_DIAG_Register_t;
/* Chip temperature */
typedef union TLE9012_INT_TEMP_Register_u
{
	struct TLE9012_INT_TEMP_Register_s
	{
		uint16_t  RESULT:   10; /* Result of block voltage measurement */
		uint16_t  RES_0:     3; /* Reserved for future use */
		uint16_t  VALID:     1; /* Indicating a valid result */
		uint16_t  RES_1:     2; /* Reserved for future use */
	} B;
	uint16_t U16;

