hopegeng/nc_bq79600_ads/app/tle9012/inc/tle9012_reg.h
} TLE9012_INT_TEMP_Register_t;
/* Multiread command */
typedef union TLE9012_MULTI_READ_Register_u
{
	struct TLE9012_MULTI_READ_Register_s
	{
		uint16_t  RES:      16; /* Reserved for future use */
	} B;
	uint16_t U16;

} TLE9012_MULTI_READ_Register_t;
/* Multiread Configuration */
typedef union TLE9012_MULTI_READ_CFG_Register_u
{
	struct TLE9012_MULTI_READ_CFG_Register_s
	{
		uint16_t  CVM_SEL:         4; /* Selects which CVM results are part of the multiread */
		uint16_t  BVM_SEL:         1; /* Selects if BVM result is part of the multiread */
		uint16_t  EXT_TEMP_SEL:    3; /* Selects which TEMP result is part of the multiread */
		uint16_t  EXT_TEMP_R_SEL:  1; /* Selects if R_DIAG result is part of the multiread */
		uint16_t  INT_TEMP_SEL:    1; /* Selects if INT_TEMP result is part of the multiread */
		uint16_t  RES:             6; /* Reserved for future use */
	} B;
	uint16_t U16;

} TLE9012_MULTI_READ_CFG_Register_t;
/* Passive bal. diagnosis OVERCURRENT */
typedef union TLE9012_BAL_DIAG_OC_Register_u
{
	struct TLE9012_BAL_DIAG_OC_Register_s
	{
		uint16_t  OC_0:  1; /* Balancing overcurrent in cell 0 */
		uint16_t  OC_1:  1; /* Balancing overcurrent in cell 1 */
		uint16_t  OC_2:  1; /* Balancing overcurrent in cell 2 */
		uint16_t  OC_3:  1; /* Balancing overcurrent in cell 3 */
		uint16_t  OC_4:  1; /* Balancing overcurrent in cell 4 */
		uint16_t  OC_5:  1; /* Balancing overcurrent in cell 5 */
		uint16_t  OC_6:  1; /* Balancing overcurrent in cell 6 */
		uint16_t  OC_7:  1; /* Balancing overcurrent in cell 7 */
		uint16_t  OC_8:  1; /* Balancing overcurrent in cell 8 */
		uint16_t  OC_9:  1; /* Balancing overcurrent in cell 9 */
		uint16_t  OC_10: 1; /* Balancing overcurrent in cell 10 */
		uint16_t  OC_11: 1; /* Balancing overcurrent in cell 11 */
		uint16_t  RES:   4; /* Reserved for future use */
	} B;
	uint16_t U16;

} TLE9012_BAL_DIAG_OC_Register_t;
/* Passive bal. diagnosis UNDERCURRENT */
typedef union TLE9012_BAL_DIAG_UC_Register_u
{
	struct TLE9012_BAL_DIAG_UC_Register_s
	{
		uint16_t  UC_0:  1; /* Balancing undercurrent in cell 0 */
		uint16_t  UC_1:  1; /* Balancing undercurrent in cell 1 */
		uint16_t  UC_2:  1; /* Balancing undercurrent in cell 2 */
		uint16_t  UC_3:  1; /* Balancing undercurrent in cell 3 */
		uint16_t  UC_4:  1; /* Balancing undercurrent in cell 4 */
		uint16_t  UC_5:  1; /* Balancing undercurrent in cell 5 */
		uint16_t  UC_6:  1; /* Balancing undercurrent in cell 6 */
		uint16_t  UC_7:  1; /* Balancing undercurrent in cell 7 */
		uint16_t  UC_8:  1; /* Balancing undercurrent in cell 8 */
		uint16_t  UC_9:  1; /* Balancing undercurrent in cell 9 */
		uint16_t  UC_10: 1; /* Balancing undercurrent in cell 10 */
		uint16_t  UC_11: 1; /* Balancing undercurrent in cell 11 */
		uint16_t  RES:   4; /* Reserved for future use */
	} B;
	uint16_t U16;

} TLE9012_BAL_DIAG_UC_Register_t;
/* Configuration   */
typedef union TLE9012_CONFIG_Register_u
{
	struct TLE9012_CONFIG_Register_s
	{
		uint16_t  IBCB_NODE_ID:  1; /* Address (ID) of the node, distributed during enumeration */
		uint16_t  RES_0:         3; /* Reserved for future use */
		uint16_t  EN_ALL_ADC:    1; /* Enable all ADCs */
		uint16_t  RES_1:         1; /* Reserved for future use */
		uint16_t  FN:            1; /* Final Node */
		uint16_t  RES_2:         4; /* Reserved for future use */
	} B;
	uint16_t U16;

} TLE9012_CONFIG_Register_t;
/* General purpose input / output */
typedef union TLE9012_GPIO_Register_u
{
	struct TLE9012_GPIO_Register_s
	{
		uint16_t  IN_GPIO0:   1; /* GPIO 0 input state (ignored if communication over GPIO pins) */
		uint16_t  OUT_GPIO0:  1; /* GPIO 0 output setting (ignored if communication over GPIO pins) */
		uint16_t  DIR_GPIO0:  1; /* GPIO 0 direction (ignored if communication over GPIO pins) */
		uint16_t  IN_GPIO1:   1; /* GPIO 1 input state (ignored if communication over GPIO pins) */
		uint16_t  OUT_GPIO1:  1; /* GPIO 1 output setting (ignored if communication over GPIO pins) */
		uint16_t  DIR_GPIO1:  1; /* GPIO 1 direction (ignored if communication over GPIO pins) */
		uint16_t  IN_PWM0:    1; /* PWM 0 input state */
		uint16_t  PWM_PWM0:   1; /* PWM 0 enable PWM function */
		uint16_t  OUT_PWM0:   1; /* PWM 0 output setting */
		uint16_t  DIR_PWM0:   1; /* PWM 0 direction */
		uint16_t  IN_PWM1:    1; /* PWM 1 input state */
		uint16_t  PWM_PWM1:   1; /* PWM 1 enable PWM function */
		uint16_t  OUT_PWM1:   1; /* PWM 1 output setting */
		uint16_t  DIR_PWM1:   1; /* PWM 1 direction */
		uint16_t  RES:        1; /* Reserved for future use */
		uint16_t  VIO_UV:     1; /* VIO undervoltage error (supplied in sleep) */
	} B;
	uint16_t U16;

} TLE9012_GPIO_Register_t;

/* PWM settings */
typedef union TLE9012_GPIO_PWM_Register_u
{
	struct TLE9012_GPIO_PWM_Register_s
	{
		uint16_t  PWM_DUTY_CYCLE:  5; /* Address (ID) of the node, distributed during enumeration */
		uint16_t  RES_0:           3; /* Reserved for future use */
		uint16_t  PWM_PERIOD:      5; /* Enable all ADCs */
		uint16_t  RES_1:           3; /* Reserved for future use */
	} B;
	uint16_t U16;

} TLE9012_GPIO_PWM_Register_t;

/* IC version and manufacturing ID */
typedef union TLE9012_ICVID_Register_u
{
	struct TLE9012_ICVID_Register_s
	{
		uint16_t  VERSION_ID:       8; /* Version ID */
		uint16_t  MANUFACTURER_ID:  8; /* Manufacturer ID */
	} B;
	uint16_t U16;

} TLE9012_ICVID_Register_t;

/* Mailbox register */
typedef union TLE9012_MAILBOX_Register_u
{
	struct TLE9012_MAILBOX_Register_s
	{
		uint16_t  DATA:  16; /* Data storage register */
	} B;
	uint16_t U16;

} TLE9012_MAILBOX_Register_t;

/* Customer ID */
typedef union TLE9012_CUSTOMER_ID_Register_u
{
	struct TLE9012_CUSTOMER_ID_Register_s
	{
		uint16_t  DATA:  16; /* Reserved for potential unique ID */
	} B;
	uint16_t U16;

} TLE9012_CUSTOMER_ID_Register_t;

/* Watchdog counter */
typedef union TLE9012_WDOG_CNT_Register_u
{
	struct TLE9012_WDOG_CNT_Register_s
	{
		uint16_t  WD_CNT:  1; /* Enable cell monitoring for cell 0 */
		uint16_t  MAIN_CNT:  1; /* Enable cell monitoring for cell 0 */
	} B;
	uint16_t U16;

} TLE9012_WDOG_CNT_Register_t;


typedef enum TLE9012_Register_Index_tag
{
	RESERVED_0          = 0x00,
	PART_CONFIG 		= 0x01, /* Partitioning config (supplied in sleep) */
	OL_OV_THR 			= 0x02, /* Cell voltage thresholds (supplied in sleep) */
	OL_UV_THR 			= 0x03, /* Cell voltage thresholds (supplied in sleep) */
	TEMP_CONF 			= 0x04, /* Temperature measurement configuration (supplied in sleep) */
	INT_OT_WARN_CONF 	= 0x05, /* Internal temperature measurement configuration (supplied in sleep)*/
	RR_ERR_CNT 			= 0x08, /* Round Robin ERR counters (supplied in sleep) */
	RR_CONFIG 			= 0x09, /* Round Robin configuration (supplied in sleep) */
	FAULT_MASK 			= 0x0A, /* ERR pin / EMM mask (supplied in sleep) */
	GEN_DIAG 			= 0x0B, /* General diagnosis (supplied in sleep) */
	CELL_UV 			= 0x0C, /* Cell voltage supervision warning flags UV (supplied in sleep)*/
	CELL_OV 			= 0x0D, /* Cell voltage supervision warning flags OV(supplied in sleep) */
	EXT_TEMP_DIAG 		= 0x0E, /* External overtemperature warning flags (supplied in sleep) */
	DIAG_OL 			= 0x10, /* Diagnosis OPENLOAD (supplied in sleep) */
	REG_CRC_ERR 		= 0x11, /* REG_CRC_ERR (supplied in sleep) */
	CELL_UV_DAC_COMP 	= 0x12,	/* Cell voltage supervision warning flags UV, (supplied in sleep)" */
	CELL_OV_DAC_COMP	= 0x13, /* Cell voltage supervision warning flags OV, (supplied in sleep)" */
	OP_MODE 			= 0x14, /* Operation mode */
	BAL_CURR_THR 		= 0x15, /* Balancing current thresholds */
	BAL_SETTINGS 		= 0x16, /* Balance settings */
	AVM_CONFIG 			= 0x17, /* Auxiliary Voltage Measurement Configuration */
	MEAS_CTRL 			= 0x18, /* Measurement control */
	CVM_0 				= 0x19, /* Cell voltage measurement 0 */
	CVM_1 				= 0x1A, /* Cell voltage measurement 1 */
	CVM_2 				= 0x1B, /* Cell voltage measurement 2 */
	CVM_3 				= 0x1C, /* Cell voltage measurement 3 */
	CVM_5 				= 0x1E, /* Cell voltage measurement 5 */
	CVM_4 				= 0x1D, /* Cell voltage measurement 4 */
	CVM_6 				= 0x1F, /* Cell voltage measurement 6 */
	CVM_7 				= 0x20, /* Cell voltage measurement 7 */
	CVM_8 				= 0x21, /* Cell voltage measurement 8 */
	CVM_9 				= 0x22, /* Cell voltage measurement 9 */
	CVM_10 				= 0x23, /* Cell voltage measurement 10 */
	CVM_11				= 0x24, /* Cell voltage measurement 11 */
	SAR_HIGH			= 0x25,	/* SAR highest cell voltage */
	SAR_LOW				= 0x26, /* SAR lowest cell voltage */
	BVM 				= 0x28, /* Block voltage measurement */
	EXT_TEMP_0 			= 0x29, /* Temp result 0 */
	EXT_TEMP_1 			= 0x2A, /* Temp result 1 */
	EXT_TEMP_2			= 0x2B, /* Temp result 2 */
	EXT_TEMP_3 			= 0x2C, /* Temp result 3 */
	EXT_TEMP_4 			= 0x2D, /* Temp result 4 */
	EXT_TEMP_R_DIAG 	= 0x2F, /* Temp result R Diagnose */
	INT_TEMP 			= 0x30, /* Chip temperature */
	MULTI_READ 			= 0x31, /* Multiread command */
	MULTI_READ_CFG 		= 0x32, /* Multiread Configuration */
	BAL_DIAG_OC 		= 0x33, /* Passive bal. diagnosis OVERCURRENT */
	BAL_DIAG_UC 		= 0x34, /* Passive bal. diagnosis UNDERCURRENT */
	INT_TEMP_2			= 0x35, /* INternal temperature 2 measurement */
	CONFIG 				= 0x36, /* Configuration   */
	GPIO 				= 0x37, /* General purpose input / output */
	GPIO_PWM 			= 0x38, /* PWM settings */
	ICVID 				= 0x39, /* IC version and manufacturing ID */
	MAILBOX 			= 0x3A, /* Mailbox register */
	CUSTOMER_ID_0 		= 0x3B, /* Customer ID */
	CUSTOMER_ID_1 		= 0x3C, /* Customer ID */
	WDOG_CNT 			= 0x3D,  /* Watchdog counter */
	SCVM_CONFIG 		= 0x3E	/* SCVM configuration*/

}TLE9012_Register_Index_t;


