hopegeng/nc_bq79600_ads/app/tle9012/inc/tle9012_reg.h
typedef union TLE9012_Register_u
{
	struct  TLE9012_Register_s
	{
		uint16_t							reserved_0;
		TLE9012_PART_CONFIG_Register_t		PART_CONFIG_Reg;
		TLE9012_OL_OV_THR_Register_t		OL_OV_THR_Reg;
		TLE9012_OL_UV_THR_Register_t		OL_UV_THR_Reg;
		TLE9012_TEMP_CONF_Register_t		TEMP_CONF_Reg;
		TLE9012_INT_OT_WARN_CONF_Register_t	INT_OT_WARN_CONF_Reg;
		uint16_t							reserved_1[2];
		TLE9012_RR_ERR_CNT_Register_t		RR_ERR_CNT_Reg;
		TLE9012_RR_CONFIG_Register_t		RR_CONFIG_Reg;
		TLE9012_FAULT_MASK_Register_t		FAULT_MASK_Reg;
		TLE9012_GEN_DIAG_Register_t			GEN_DIAG_Reg;
		TLE9012_CELL_UV_Register_t			CELL_UV_Reg;
		TLE9012_CELL_OV_Register_t			CELL_OV_Reg;
		TLE9012_EXT_TEMP_DIAG_Register_t	EXT_TEMP_DIAG_Reg;
		uint16_t							reserved_2;
		TLE9012_DIAG_OL_Register_t			DIAG_OL_Reg;
		TLE9012_REG_CRC_ERR_Register_t		REG_CRC_ERR_Reg;
		uint16_t							reserved_3[2];
		TLE9012_OP_MODE_Register_t			OP_MODE_Reg;
		TLE9012_BAL_CURR_THR_Register_t		BAL_CURR_THR_Reg;
		TLE9012_BAL_SETTINGS_Register_t		BAL_SETTINGS_Reg;
		TLE9012_AVM_CONFIG_Register_t		AVM_CONFIG_Reg;
		TLE9012_MEAS_CTRL_Register_t		MEAS_CTRL_Reg;
		TLE9012_CVM_Register_t				CVM_Reg[12];
		uint16_t							reserved_4[3];
		TLE9012_BVM_Register_t				BVM_Reg;
		TLE9012_EXT_TEMP_Register_t			EXT_TEMP_Reg[5];
		uint16_t							reserved_5;
		TLE9012_EXT_TEMP_R_DIAG_Register_t	EXT_TEMP_R_DIAG_Reg;
		TLE9012_INT_TEMP_Register_t			INT_TEMP_Reg;
		TLE9012_MULTI_READ_Register_t		MULTI_READ_Reg;
		TLE9012_MULTI_READ_CFG_Register_t	MULTI_READ_CFG_Reg;
		TLE9012_BAL_DIAG_OC_Register_t		BAL_DIAG_OC_Reg;
		TLE9012_BAL_DIAG_UC_Register_t		BAL_DIAG_UC_Reg;
		uint16_t							reserved_6;
		TLE9012_CONFIG_Register_t			CONFIG_Reg;
		TLE9012_GPIO_Register_t				GPIO_Reg;
		TLE9012_GPIO_PWM_Register_t			GPIO_PWM_Reg;
		TLE9012_ICVID_Register_t			ICVID_Reg;
		TLE9012_MAILBOX_Register_t			MAILBOX_Reg;
		TLE9012_CUSTOMER_ID_Register_t		CUSTOMER_ID_Reg;
		TLE9012_WDOG_CNT_Register_t 		WDOG_CNT_Reg;
	} Reg;
	uint16_t U16[WDOG_CNT+1];
} TLE9012_Register_t;

#endif /* TLE9012_TLE9012_REG_H_ */


